#include <iostream>
#include <vector>
#include <algorithm>

int arr[10000005] = {};

using namespace std;

int main()
{
	int N;
	cin >> N;

	arr[1] = 0;
	arr[2] = 1;
	arr[3] = 1;

	for (int i = 4; i <= N; i++)
	{
		arr[i] = N + 1;
	}

	for (int i = 3; i <= N; i++)
	{
		if (i + 1 <= N)
		{
			arr[i + 1] = min(arr[i] + 1, arr[i + 1]);
		}

		if (i * 2 <= N)
		{
			arr[i * 2] = min(arr[i] + 1, arr[i * 2]);
		}

		if (i * 3 <= N)
		{
			arr[i * 3] = min(arr[i] + 1, arr[i * 3]);
		}
	}

	cout << arr[N];

	return 0;
}

// X가 3으로 나누어 떨어지면, 3으로 나눈다.
// X가 2로 나누어 떨어지면, 2로 나눈다.
// 1을 뺀다

//10 -> -1 , 3 , 3
//10 -> 2, -1, 2, 2

//어떻게 해서든 3으로 나누어 떨어지게 노력해야됨

//13 -> -1(12), 3(4), -1(3), 3(1)
//14 -> 7 -> 6 -> 2 -> 1
//14 -> 13 -> 12 -> 4 -> 3 -> 1

//17 -> 16 -> 8 -> 4 -> 2 -> 1
//17 -> 16 -> 15 -> 5 -> 4 -> 2-> 1

//100 -> 50 -> 25 -> 24 -> 8 -> 4 -> 3 -> 1
//100 -> 99 -> 33 -> 11 -> 10 ->9 -> 3 -> 1

//16 -> 15 -> 5 -> 

//-> N % 3 = 2라면 3을 최우선적으로

